EDT/МПСтриж/src/Documents/ДанныеЗаказаВодителя/ДанныеЗаказаВодителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеЗаказаВодителя</name>
  <posting>Deny</posting>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженВБД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказаВодитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодъема</name>
    <type>
      <types>EnumRef.ВидыПодъемовВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>DocumentRef.ЧекКПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторовЗапросаСостоянияЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЧекаНаПечать</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечатиЧеков</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправкиЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаФормированияЧекаНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратныйЧек</name>
    <type>
      <types>DocumentRef.ЧекКПечатиВозвратПрихода</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПодъемногоБрейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъемаРассчитанная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъемаПодтвержденная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоХодокНаЭтаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестоваяСреда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУстановленБезКИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСтоимостьДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченаСтоимостьДоставкиПриОтменеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаЧерезAssist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БылаПроизведенаПримерка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоSKUПримерки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратНаДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоставленныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоставщикТовара</name>
      <type>
        <types>CatalogRef.ПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/МПСтриж/src/Documents/ДанныеЗаказаВодителя/ManagerModule.bsl
Процедура ЭмуляцияВводаДанныхВодителемПоИнициативеПартнера(Заказ, РезультатДоставки, ДатаПереноса = "") Экспорт
	НовыйДок = СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Реализация = Заказ;
	НовыйДок.РезультатДоставки = РезультатДоставки;
	НовыйДок.ДатаПереноса = ДатаПереноса;
	НовыйДок.ТипОплаты = Заказ.ТипОплаты;
	
	
	НовыйДок.СуммаДоставка = Заказ.СуммаДоставка;
			
	Для каждого Тек Из Заказ.Товары Цикл
		НовТов = НовыйДок.ДоставленныеТовары.Добавить();
		НовТов.Номенклатура = Тек.Товар;
		НовТов.КоличествоДоставлено = Тек.Количество;
		НовТов.Цена = Тек.Цена;
		НовТов.Сумма = Тек.Сумма;
		НовТов.СтавкаНДС = Тек.СтавкаНДС;
		НовТов.ШтрихкодТовара = Тек.ШтрихкодТовара;
		НовТов.КодМаркировки = Тек.КодМаркировки;
		НовТов.ПоставщикТовара = Тек.ПоставщикТовара;
	КонецЦикла;	
	
	Если НовыйДок.ТипОплаты = Справочники.ТипыОплат.Наличные Или НовыйДок.ТипОплаты = Справочники.ТипыОплат.Терминал Тогда
		НовыйДок.СуммаНал = НовыйДок.СуммаДоставка + НовыйДок.ДоставленныеТовары.Итог("Сумма");
	КонецеСли;	
	
	НовыйДок.ТестоваяСреда = Константы.ТестоваяСреда.Получить();
	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	ПланыОбмена.УдалитьРегистрациюИзменений(Константы.УзелПланаОбмена.Получить(), НовыйДок.Ссылка);
КонецПроцедуры
